/*********************************************************************************************************
* 模块名称：UART0.h
* 摘    要：串口0模块，包括该模块初始化以及串口发送功能
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期：2021年07月01日 
* 内    容：
*********************************************************************************************************/
#ifndef _UART0_H_
#define _UART0_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include "DataType.h"

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitUART0(unsigned int bound);                                //初始化UART0模块
unsigned char  WriteUART0(unsigned char *pBuf, unsigned char len);  //写串口，返回写数据的个数
void UART0_SendSPO2Data(SPO2Data_t *pData);                         //发送血氧数据
unsigned char UART0_GetCmd(unsigned char *cmd, unsigned char *val); // 获取控制命令

#endif
